#6
days = ["31","28","31","30","31","30",
        "31","31","30","31","30","31"]
months = ["січень","лютий","березень","квітень",
          "травень","червень","липень","серпень",
          "вересень","жовтень","листопад","грудень"]
date = int(input(" Введіть номер місяця : ")) - 1
if 0 <= date < 12 :
        print('У місяці', months[date], days[date], 'день', sep = ' ')
else :
        print('Оберіть номер місяця від 1 до 12 !!!')
#1. Спочатку створюємо два масива "days" і "months", 
# будь-який день який ми візьмемо у масиві "days" буде співпадати
# по індексу з назвою місяця у масиві "months", але індекс буде на одиничку
# більшим за порядком цього місяця у році
#2. Але щоб це виправити це ми вводимо змінну "date" і вкладаємо її у
# функцію input, результатом цієї функції буде тип данних - стрічка, але ми не можемо
# відняти від стрічки число так як це різні структури данних, отже нам потрібно 
# використати функцію int, тоді результатом змінної date буде число
#3. За допомогою синтаксиса if/else ми створюємо область визначення для
# змінною "date", вона буде знаходитися у проміжку 0 <= date < 12
#4. За допогою функції print та її методу sep ми конкатенуємо стрічки, 
# які ми ввели в print
# Висновок: на цій лабораторній роботі я навчився створювати масиви та
# та користуватися ними, сподіваюсь ці знання мені знадобляться у майбутньому